; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_4 ?v5 - type_2 ?v2 - type_1)
 	      (pred_2 ?v8 - object ?v2 - type_1)
	      (pred_1 ?v5 - type_2 ?v4 - type_3)
	      (pred_3 ?v5 - type_2 ?v8 - object ?v4 - type_3))

   (:action op_1
       :parameters  (?v5 - type_2 ?v6 ?v3 - type_1)
       :precondition (and  (pred_4 ?v5 ?v6))
       :effect (and  (pred_4 ?v5 ?v3)
		     (not (pred_4 ?v5 ?v6))))

   (:action op_3
       :parameters (?v5 - type_2 ?v1 - object ?v7 - type_1 ?v4 - type_3)
       :precondition  (and  (pred_2 ?v1 ?v7) (pred_4 ?v5 ?v7) (pred_1 ?v5 ?v4))
       :effect (and (pred_3 ?v5 ?v1 ?v4)
		    (not (pred_2 ?v1 ?v7)) 
		    (not (pred_1 ?v5 ?v4))))

   (:action op_2
       :parameters (?v5 - type_2 ?v1 - object ?v7 - type_1 ?v4 - type_3)
       :precondition  (and  (pred_3 ?v5 ?v1 ?v4) (pred_4 ?v5 ?v7))
       :effect (and (pred_2 ?v1 ?v7)
		    (pred_1 ?v5 ?v4)
		    (not (pred_3 ?v5 ?v1 ?v4)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_05 obj_03 - type_2
obj_09 obj_11 obj_06 obj_04 - type_3
obj_13 obj_02 obj_08 obj_12 - type_1
obj_01 obj_07 obj_10 - object)
(:init
(pred_4 obj_05 obj_08)
(pred_1 obj_05 obj_09)
(pred_1 obj_05 obj_11)
(pred_4 obj_03 obj_08)
(pred_1 obj_03 obj_06)
(pred_1 obj_03 obj_04)
(pred_2 obj_01 obj_13)
(pred_2 obj_07 obj_13)
(pred_2 obj_10 obj_13)
)
(:goal
(and
(pred_2 obj_01 obj_12)
(pred_2 obj_07 obj_13)
(pred_2 obj_10 obj_13)
)
)

(:constraints
  (always (not (pred_4 obj_05 obj_12)))
)
)

; plan
1. (op_1 obj_05 obj_08 obj_13)
   deleted: (pred_4 obj_05 obj_08)
   added: (pred_4 obj_05 obj_13)
   goals met: 2 of 3
2. (op_1 obj_03 obj_08 obj_13)
   deleted: (pred_4 obj_03 obj_08)
   added: (pred_4 obj_03 obj_13)
   goals met: 2 of 3
3. (op_3 obj_03 obj_01 obj_13 obj_04)
   deleted: (pred_2 obj_01 obj_13) (pred_1 obj_03 obj_04)
   added: (pred_3 obj_03 obj_01 obj_04)
   goals met: 2 of 3
4. (op_1 obj_03 obj_13 obj_12)
   deleted: (pred_4 obj_03 obj_13)
   added: (pred_4 obj_03 obj_12)
   goals met: 2 of 3
5. (op_2 obj_03 obj_01 obj_12 obj_04)
   deleted: (pred_3 obj_03 obj_01 obj_04)
   added: (pred_2 obj_01 obj_12) (pred_1 obj_03 obj_04)
   goals met: 3 of 3
